# Enable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..Enable Method
SlabShapeEditor Class See Also
---
Enables the slab shape editing functionality.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Enable()
```

Visual Basic
---
```text
Public Sub Enable
```

Visual C++
---
```text
public:
void Enable()
```

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace